{
  "systemKnowledge": [
    {
      "name": "DeepSeek",
      "content": "## **操作指南**\n\nDeepThink（深度思考）和 Search（搜索）是两种不同的信息处理方式，适用于不同的场景。以下是它们的主要特点和适用场景对比：\n\n---\n\n### **1. DeepThink（深度思考）**\n**特点**：  \n- 强调逻辑推理、综合分析或创造性思维。  \n- 适合解决需要深入理解、抽象概念或复杂决策的问题。  \n- 通常不需要依赖外部信息，而是基于已有知识进行推导。  \n\n**适用场景**：  \n- **复杂问题分析**：如战略规划、哲学讨论、数学证明等。  \n- **创意生成**：如写作、产品设计、艺术创作等。  \n- **主观决策**：如个人价值观权衡、伦理困境等。  \n- **系统化学习**：如理解一个理论框架或学科的内在逻辑。  \n\n**例子**：  \n- “如何设计一个可持续发展的商业模式？”  \n- “尼采的‘超人哲学’对现代社会的意义是什么？”  \n\n---\n\n### **2. Search（搜索）**\n**特点**：  \n- 快速获取外部已有的信息或事实。  \n- 适合需要具体数据、最新动态或权威答案的场景。  \n- 依赖外部资源（如数据库、文献、互联网）。  \n\n**适用场景**：  \n- **事实查询**：如历史事件日期、科学常数、名词解释等。  \n- **实时信息**：如新闻、股价、天气等。  \n- **技术细节**：如代码语法、错误解决方案、操作手册等。  \n- **比较型问题**：如“iPhone 15 和华为 Mate 60 的摄像头参数对比”。  \n\n**例子**：  \n- “2023年诺贝尔经济学奖得主是谁？”  \n- “Python 如何用正则表达式提取字符串？”  \n\n---\n\n### **如何选择？**\n- **用 DeepThink**：当问题需要原创性思考、多角度分析或长期价值判断时。  \n- **用 Search**：当问题有明确答案、依赖客观事实或需快速响应时。  \n\n**混合场景**：许多问题需要两者结合。例如：  \n1. 先 **Search** 收集数据（如市场调研报告），  \n2. 再 **DeepThink** 分析趋势并提出策略。\n\n---\n\n### **注意事项**\n你要先选择模式，然后输入任务指令后，通过回车向 DeepSeek 提问。\n每次向 DeepSeek 提问后，你都应该等待15秒时间直到它全部输出完成。\n如果输出的内容过多，你需要向下拖动滚动条才能看到全部内容。",
      "language": "zh"
    },
    {
      "name": "DeepSeek",
      "content": "## **Operation Guide**\n\nDeepThink and Search are two different methods of information processing, suitable for different scenarios. Below is a comparison of their main features and applicable scenarios:\n\n---\n\n### **1. DeepThink**\n**Features**:  \n- Emphasizes logical reasoning, comprehensive analysis, or creative thinking.  \n- Suitable for solving problems that require deep understanding, abstract concepts, or complex decision-making.  \n- Usually doesn't rely on external information, but derives from existing knowledge.  \n\n**Applicable Scenarios**:  \n- **Complex Problem Analysis**: Such as strategic planning, philosophical discussions, mathematical proofs, etc.  \n- **Creative Generation**: Such as writing, product design, artistic creation, etc.  \n- **Subjective Decision-Making**: Such as personal value judgments, ethical dilemmas, etc.  \n- **Systematic Learning**: Such as understanding the internal logic of a theoretical framework or discipline.  \n\n**Examples**:  \n- \"How to design a sustainable business model?\"  \n- \"What is the significance of Nietzsche's 'Superman philosophy' for modern society?\"  \n\n---\n\n### **2. Search**\n**Features**:  \n- Rapidly acquires existing external information or facts.  \n- Suitable for scenarios requiring specific data, latest updates, or authoritative answers.  \n- Relies on external resources (such as databases, literature, internet).  \n\n**Applicable Scenarios**:  \n- **Fact Queries**: Such as historical event dates, scientific constants, term definitions, etc.  \n- **Real-time Information**: Such as news, stock prices, weather, etc.  \n- **Technical Details**: Such as code syntax, error solutions, operation manuals, etc.  \n- **Comparison Questions**: Such as \"Camera parameter comparison between iPhone 15 and Huawei Mate 60\".  \n\n**Examples**:  \n- \"Who won the Nobel Prize in Economics in 2023?\"  \n- \"How to extract strings using regular expressions in Python?\"  \n\n---\n\n### **How to Choose?**\n- **Use DeepThink**: When the problem requires original thinking, multi-angle analysis, or long-term value judgment.  \n- **Use Search**: When the problem has a clear answer, depends on objective facts, or needs quick response.  \n\n**Mixed Scenarios**: Many problems need a combination of both. For example:  \n1. First **Search** to collect data (such as market research reports),  \n2. Then **DeepThink** to analyze trends and propose strategies.\n\n---\n\n### **Notes**\nYou need to select a mode first, then enter your task instructions and press Enter to ask DeepSeek.\nAfter each question to DeepSeek, you should wait 15 seconds until it has completed its output.\nIf there is too much content, you'll need to scroll down to see everything.",
      "language": "en"
    }
  ]
} 